/*****************************************************************************
 * | @file    : main.c
 * | @author  : liubo
 * --------------------------------------
 * | @version  @date
 * |  V1.0.0    2025-10-15
 * ---------------------------------------
 * | @brief   : main template
 ******************************************************************************/
#include <iostream> // 包含输入和输出操作
#include <stdio.h>  // C语言的标准库，包含C语言流操作 printf等
#include <string.h> // C语言的标准库，包含字符串处理操作 strcpy等
#include <unistd.h> // pause()头文件
#include <cstdlib>

// #include "XXX.hpp"

using std::cin;
using std::cout;
using std::endl;
using std::string;

int main()
{
    cout << " ----------------------------------------begain---------------------------------------- " << endl;

    // 1.无参默认构造 string
    // 创建一个空的字符串
    // string();
    string s1;
    s1 = "123456789";
    cout << "s1:" << s1 << endl;

    cout << " -------------------------------------------------------------------------------- " << endl;
    //--------------------------------------------------------------------------------------------------

    // 2.拷贝构造 string
    // 2.1使用一个string对象初始化另一个string对象
    // string(const string& str);
    string s2(s1);
    cout << "s2:" << s2 << endl;

    // 2.2选取 string 字符的拷贝构造
    // 将一个字符串对象的第pos位置之后的len个字符初始化给对应的字符串对象
    // string(const string& str, size_t pos, size_t len = npos);
    string s21(s1, 0, 3);
    cout << "s21:" << s21 << endl;

    string s22(s1, 1, 3);
    cout << "s22:" << s22 << endl;

    string s23(s1, 2, 3);
    cout << "s23:" << s23 << endl;

    cout << " -------------------------------------------------------------------------------- " << endl;
    //--------------------------------------------------------------------------------------------------

    // 3.使用c类型字符串构造 string
    // 3.1使用长变量构造
    // string(const char* s);
    const char *s = "Hello, world!";
    string s3(s);
    cout << "s3:" << s3 << endl;

    // 3.2通过字符串常量构造
    // string(const char* s);
    string s31("hello, world");
    cout << "s31:" << s31 << endl;

    // 3.3通过字符串前n个字符构造
    // string(const char* s, size_t n);
    string s32("123456789", 6);
    cout << "s32:" << s32 << endl;

    cout << " -------------------------------------------------------------------------------- " << endl;
    //--------------------------------------------------------------------------------------------------

    // 4.使用n个字符c构造 string
    // string(size_t n, char c);
    string s4(10, 'x');
    cout << "s4:" << s4 << endl;

    cout << " ----------------------------------------end---------------------------------------- " << endl;

    // cin.get();
    // getchar();
    // pause();
    return EXIT_SUCCESS;
}

/*****************************************************************************
 * end of file
 ******************************************************************************/
