/*****************************************************************************
 * | @file    : 03_STL_string_set_element.c
 * | @author  : liubo
 * --------------------------------------
 * | @version  @date
 * |  V1.0.0    2025-04-01
 * ---------------------------------------
 * | @brief   : main template
 ******************************************************************************/
#include <stdio.h>  // C语言的标准库，包含C语言流操作 printf等
#include <iostream> // 包含输入和输出操作
#include <string.h> // C语言的标准库，包含字符串处理操作 strcpy等
#include <unistd.h> // pause()头文件

// #include "XXX.hpp"

using std::cin;
using std::cout;
using std::endl;
using std::string;

int main()
{
    cout << " -------------------- begain -------------------- " << endl;
    // 1. 重载[]运算符，n是下标
    // char &operator[](int n);
    string s1("hello, world");
    s1[0] = 'H'; //将字符串第1个元素改为H
    cout << "s1:" << s1 << endl;

    s1[7] = 'W'; //将字符串第8个元素改为H
    cout << "s1:" << s1 << endl;

    cout << " ---------------------------------------- " << endl;

    // 2. 通过at方法获取下标为n的元素
    // char &at(int n);

    string s2("hello, world");
    s2.at(0) = 'H'; //将字符串第1个元素改为H
    cout << "s2:" << s2 << endl;

    s2.at(7) = 'W'; //将字符串第8个元素改为H
    cout << "s2:" << s2 << endl;

    cout << " -------------------- end -------------------- " << endl;
    // cin.get();
    // getchar();
    // pause();

    // 20
    // --------------------

    // 40
    // ----------------------------------------

    // 80
    // --------------------------------------------------------------------------------

    return EXIT_SUCCESS;
}

/*****************************************************************************
 * end of file
 ******************************************************************************/
